program/Note_flask.org
#+TITLE:     flask Notes
#+AUTHOR:    DeepAlgorithms
#+OPTIONS: num:nil
#+SETUPFILE: ~/mynotes/org2html/org-theme-collection/theme2.setup
#+HTML_HEAD: <link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">

source Corey Schafer flask playslit : https://www.youtube.com/watch?v=MwZwr5Tvyxo&list=PL-osiE80TeTs4UjLw5MM6OjgkjFeUxCYH




* Flask Introduction
Intro 
* Create Virtual Env 
#+BEGIN_SRC sh
cd myflask-app

conda create --name flask-webapp
conda activate flask-webapp
conda install flask

touch flaskblog.py
# The contant of flaskblog.py is below  
#+END_SRC


#+begin_src python
# https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/01-Getting-Started/flaskblog.py

# myflask-app/flaskblog.py


from flask import Flask
app = Flask(__name__)


@app.route("/")
@app.route("/home")
def home():
    return "<h1>Home Page</h1>"


if __name__ == '__main__':
    app.run(debug=True)

#+end_src
* Run Flask app
We can run flask in two ways

#+begin_src sh
export FLASK_APP=main.py
export FLASK_DEBUG=1

# To run the app using flask
flask run

# Run using python
python flaskblog.py # or
flask run 
#+end_src
* Create about page
see if =about= page is created by routing to about page  =localhost:5000/about=
If about page is created
- Then it will redirect to about page
- if not it will send =ERROR 404= =Page Not Found=

Create about page 
#+begin_src python
# https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/01-Getting-Started/flaskblog.py

# myflask-app/flaskblog.py


from flask import Flask
app = Flask(__name__)


@app.route("/")
@app.route("/home")
def home():
    return "<h1>Home Page</h1>"


@app.route("/about")
def about():
    return "<h1>About Page</h1>"


if __name__ == '__main__':
    app.run(debug=True)
#+end_src

* Create a templates
Instead of returning html tag in =return "<h1> Home Page </h1>"= we can use template dir which stores tempalate file like =layout, home, footer, about, posts...etc=
#+begin_src sh
cd myflask-app
mkdir templates static
touch static/main.css
cd templates
touch about.tml home.html layout.html
#+end_src

The flask app with template
- To render from tempate we use =import render_tempalate=
- To convert relative path and add to absolute path we use =url_for= eg : add css and js from the *static dir*
#+begin_src python
# myflask-app/flaskblog.py
from flask import Flask, render_template, url_for
app = Flask(__name__)

posts = [
    {
        'author': 'Corey Schafer',
        'title': 'Blog Post 1',
        'content': 'First post content',
        'date_posted': 'April 20, 2018'
    },
    {
        'author': 'Jane Doe',
        'title': 'Blog Post 2',
        'content': 'Second post content',
        'date_posted': 'April 21, 2018'
    }
]


@app.route("/")
@app.route("/home")
def home():
    return render_template('home.html', posts=posts)


@app.route("/about")
def about():
    return render_template('about.html', title='About')


if __name__ == '__main__':
    app.run(debug=True)
#+end_src

The css file is give below
#+begin_src css
/* myflask-app/static/main.css */
/* https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/02-Templates/static/main.css */

body {
  background: #fafafa;
  color: #333333;
  margin-top: 5rem;
}

h1, h2, h3, h4, h5, h6 {
  color: #444444;
}

.bg-steel {
  background-color: #5f788a;
}

.site-header .navbar-nav .nav-link {
  color: #cbd5db;
}

.site-header .navbar-nav .nav-link:hover {
  color: #ffffff;
}

.site-header .navbar-nav .nav-link.active {
  font-weight: 500;
}

.content-section {
  background: #ffffff;
  padding: 10px 20px;
  border: 1px solid #dddddd;
  border-radius: 3px;
  margin-bottom: 20px;
}

.article-title {
  color: #444444;
}

a.article-title:hover {
  color: #428bca;
  text-decoration: none;
}

.article-content {
  white-space: pre-line;
}

.article-img {
  height: 65px;
  width: 65px;
  margin-right: 16px;
}

.article-metadata {
  padding-bottom: 1px;
  margin-bottom: 4px;
  border-bottom: 1px solid #e3e3e3
}

.article-metadata a:hover {
  color: #333;
  text-decoration: none;
}

.article-svg {
  width: 25px;
  height: 25px;
  vertical-align: middle;
}

.account-img {
  height: 125px;
  width: 125px;
  margin-right: 20px;
  margin-bottom: 16px;
}

.account-heading {
  font-size: 2.5rem;
}

#+end_src

We will create a =layout= for our blog  with css file in =myflask-app/static/main.css= 
#+begin_src html
<!-- layout.html -->
<!DOCTYPE html>
<html>
<head>
<!-- add css and js files -->
    <link rel="stylesheet" type="text/css" href="{{ url_for('static', filename='main.css') }}">
    {% if title %}
        <title>Flask Blog - {{ title }}</title>
    {% else %}
        <title>Flask Blog</title>
    {% endif %}
</head>
<body>
   <div  class="container">
          {% block content %}
          {% endblock %}
   </div>
<!-- jQuery, JavaScript, Bootstrap JS files -->   
</body>
</html>
#+end_src

home page template
python flask uses template using =jinja2 template=
- for =inserting or including file= or =loop=, =condition=  we use ={}= tags
- for python variable we use ={{dict.key}}=
  
#+begin_src html
<!-- home.html -->
{% extends "layout.html" %}
{% block content %}
    {% for post in posts %}
        <article class="media content-section">
          <div class="media-body">
            <div class="article-metadata">
              <a class="mr-2" href="#">{{ post.author }}</a>
              <small class="text-muted">{{ post.date_posted }}</small>
            </div>
            <h2><a class="article-title" href="#">{{ post.title }}</a></h2>
            <p class="article-content">{{ post.content }}</p>
          </div>
        </article>
    {% endfor %}
{% endblock content %}
#+end_src

#+begin_src html
<!-- about.html -->
{% extends "layout.html" %}
{% block content %}
    <h1>About Page</h1>
{% endblock content %}
#+end_src

