program/Note_flask.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>flask Notes</title>
<meta name="author" content="DeepAlgorithms" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
<link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">
</head>
<body>
<div id="content" class="content">
<h1 class="title">flask Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc40c5d8">Flask Introduction</a></li>
<li><a href="#orga7abac0">Create Virtual Env</a></li>
<li><a href="#org39830d5">Run Flask app</a></li>
<li><a href="#org3b78b41">Create about page</a></li>
<li><a href="#org64d4942">Create a templates</a></li>
<li><a href="#org6725818">Create Forms and  Validate User Input</a></li>
<li><a href="#org7a35755">Create a Database db using sqlAlchemy</a>
<ul>
<li><a href="#orgf394920">Create sqllite database</a></li>
<li><a href="#org4ce9783">Link sqllite in flask-app</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
source Corey Schafer flask playslit : <a href="https://www.youtube.com/watch?v=MwZwr5Tvyxo&amp;list=PL-osiE80TeTs4UjLw5MM6OjgkjFeUxCYH">https://www.youtube.com/watch?v=MwZwr5Tvyxo&amp;list=PL-osiE80TeTs4UjLw5MM6OjgkjFeUxCYH</a>
</p>




<div id="outline-container-orgc40c5d8" class="outline-2">
<h2 id="orgc40c5d8">Flask Introduction</h2>
<div class="outline-text-2" id="text-orgc40c5d8">
<p>
Intro 
</p>
</div>
</div>
<div id="outline-container-orga7abac0" class="outline-2">
<h2 id="orga7abac0">Create Virtual Env</h2>
<div class="outline-text-2" id="text-orga7abac0">
<div class="org-src-container">
<pre class="src src-sh">cd myflask-app

conda create --name flask-webapp
conda activate flask-webapp
conda install flask

touch flaskblog.py
# The contant of flaskblog.py is below  
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"># https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/01-Getting-Started/flaskblog.py

# myflask-app/flaskblog.py


from flask import Flask
app = Flask(__name__)


@app.route("/")
@app.route("/home")
def home():
    return "&lt;h1&gt;Home Page&lt;/h1&gt;"


if __name__ == '__main__':
    app.run(debug=True)

</pre>
</div>
</div>
</div>
<div id="outline-container-org39830d5" class="outline-2">
<h2 id="org39830d5">Run Flask app</h2>
<div class="outline-text-2" id="text-org39830d5">
<p>
We can run flask in two ways
</p>

<div class="org-src-container">
<pre class="src src-sh">export FLASK_APP=main.py
export FLASK_DEBUG=1

# To run the app using flask
flask run

# Run using python
python flaskblog.py # or
flask run 
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b78b41" class="outline-2">
<h2 id="org3b78b41">Create about page</h2>
<div class="outline-text-2" id="text-org3b78b41">
<p>
see if <code>about</code> page is created by routing to about page  <code>localhost:5000/about</code>
If about page is created
</p>
<ul class="org-ul">
<li>Then it will redirect to about page</li>
<li>if not it will send <code>ERROR 404</code> <code>Page Not Found</code></li>
</ul>

<p>
Create about page 
</p>
<div class="org-src-container">
<pre class="src src-python"># https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/01-Getting-Started/flaskblog.py

# myflask-app/flaskblog.py


from flask import Flask
app = Flask(__name__)


@app.route("/")
@app.route("/home")
def home():
    return "&lt;h1&gt;Home Page&lt;/h1&gt;"


@app.route("/about")
def about():
    return "&lt;h1&gt;About Page&lt;/h1&gt;"


if __name__ == '__main__':
    app.run(debug=True)
</pre>
</div>
</div>
</div>

<div id="outline-container-org64d4942" class="outline-2">
<h2 id="org64d4942">Create a templates</h2>
<div class="outline-text-2" id="text-org64d4942">
<p>
Instead of returning html tag in <code>return "&lt;h1&gt; Home Page &lt;/h1&gt;"</code> we can use template dir which stores tempalate file like <code>layout, home, footer, about, posts...etc</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">cd myflask-app
mkdir templates static
touch static/main.css
cd templates
touch about.tml home.html layout.html
</pre>
</div>

<p>
The flask app with template
</p>
<ul class="org-ul">
<li>To render from tempate we use <code>import render_tempalate</code></li>
<li>To convert relative path and add to absolute path we use <code>url_for</code> eg : add css and js from the <b>static dir</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-python"># myflask-app/flaskblog.py
from flask import Flask, render_template, url_for
app = Flask(__name__)

posts = [
    {
	'author': 'Corey Schafer',
	'title': 'Blog Post 1',
	'content': 'First post content',
	'date_posted': 'April 20, 2018'
    },
    {
	'author': 'Jane Doe',
	'title': 'Blog Post 2',
	'content': 'Second post content',
	'date_posted': 'April 21, 2018'
    }
]


@app.route("/")
@app.route("/home")
def home():
    return render_template('home.html', posts=posts)


@app.route("/about")
def about():
    return render_template('about.html', title='About')


if __name__ == '__main__':
    app.run(debug=True)
</pre>
</div>

<p>
The css file is give below
</p>
<div class="org-src-container">
<pre class="src src-css">/* myflask-app/static/main.css */
/* https://github.com/CoreyMSchafer/code_snippets/blob/master/Python/Flask_Blog/02-Templates/static/main.css */

body {
  background: #fafafa;
  color: #333333;
  margin-top: 5rem;
}

h1, h2, h3, h4, h5, h6 {
  color: #444444;
}

.bg-steel {
  background-color: #5f788a;
}

.site-header .navbar-nav .nav-link {
  color: #cbd5db;
}

.site-header .navbar-nav .nav-link:hover {
  color: #ffffff;
}

.site-header .navbar-nav .nav-link.active {
  font-weight: 500;
}

.content-section {
  background: #ffffff;
  padding: 10px 20px;
  border: 1px solid #dddddd;
  border-radius: 3px;
  margin-bottom: 20px;
}

.article-title {
  color: #444444;
}

a.article-title:hover {
  color: #428bca;
  text-decoration: none;
}

.article-content {
  white-space: pre-line;
}

.article-img {
  height: 65px;
  width: 65px;
  margin-right: 16px;
}

.article-metadata {
  padding-bottom: 1px;
  margin-bottom: 4px;
  border-bottom: 1px solid #e3e3e3
}

.article-metadata a:hover {
  color: #333;
  text-decoration: none;
}

.article-svg {
  width: 25px;
  height: 25px;
  vertical-align: middle;
}

.account-img {
  height: 125px;
  width: 125px;
  margin-right: 20px;
  margin-bottom: 16px;
}

.account-heading {
  font-size: 2.5rem;
}

</pre>
</div>

<p>
We will create a <code>layout</code> for our blog  with css file in <code>myflask-app/static/main.css</code> 
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;!-- layout.html --&gt;
&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
&lt;!-- add css and js files --&gt;
    &lt;link rel="stylesheet" type="text/css" href="{{ url_for('static', filename='main.css') }}"&gt;
    {% if title %}
	&lt;title&gt;Flask Blog - {{ title }}&lt;/title&gt;
    {% else %}
	&lt;title&gt;Flask Blog&lt;/title&gt;
    {% endif %}
&lt;/head&gt;
&lt;body&gt;
   &lt;div  class="container"&gt;
	  {% block content %}
	  {% endblock %}
   &lt;/div&gt;
&lt;!-- jQuery, JavaScript, Bootstrap JS files --&gt;   
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>

<p>
home page template
python flask uses template using <code>jinja2 template</code>
</p>
<ul class="org-ul">
<li>for <code>inserting or including file</code> or <code>loop</code>, <code>condition</code>  we use <code>{}</code> tags</li>
<li>for python variable we use <code>{{dict.key}}</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-html">&lt;!-- home.html --&gt;
{% extends "layout.html" %}
{% block content %}
    {% for post in posts %}
	&lt;article class="media content-section"&gt;
	  &lt;div class="media-body"&gt;
	    &lt;div class="article-metadata"&gt;
	      &lt;a class="mr-2" href="#"&gt;{{ post.author }}&lt;/a&gt;
	      &lt;small class="text-muted"&gt;{{ post.date_posted }}&lt;/small&gt;
	    &lt;/div&gt;
	    &lt;h2&gt;&lt;a class="article-title" href="#"&gt;{{ post.title }}&lt;/a&gt;&lt;/h2&gt;
	    &lt;p class="article-content"&gt;{{ post.content }}&lt;/p&gt;
	  &lt;/div&gt;
	&lt;/article&gt;
    {% endfor %}
{% endblock content %}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html">&lt;!-- about.html --&gt;
{% extends "layout.html" %}
{% block content %}
    &lt;h1&gt;About Page&lt;/h1&gt;
{% endblock content %}
</pre>
</div>
</div>
</div>
