program/Note_flask.html

<div id="outline-container-org6725818" class="outline-2">
<h2 id="org6725818">Create Forms and  Validate User Input</h2>
<div class="outline-text-2" id="text-org6725818">
<p>
Create a registeration page to create account and  login and logout
</p>
<ul class="org-ul">
<li>Make sure name, email are valid</li>
<li>password should be valid either 6 char</li>
</ul>

<p>
For users details account creation and validation we are using lib <code>flask-wtf</code>
install <code>pip install flask-wtf</code>
</p>


<p>
Create a seperate code-file <code>form.py</code>
</p>

<p>
we use validators to validate the field-value
</p>
<ul class="org-ul">
<li><b>Name:</b>     <code>StringField</code> : Lenght min :2 and max :20</li>
<li><b>email:</b>    <code>StringField</code> : Email()[make sure it is valid email]</li>
<li><b>password:</b> <code>PasswordField</code> :</li>
<li><b>confirm-password:</b> <code>EqualTo()</code> : [Make sure it is same password enter]</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"># file: myflask-app/forms.py
from flask_wtf import FlaskForm
from wtforms import StringField, PasswordField, SubmitField, BooleanField
from wtforms.validators import DataRequired, Length, Email, EqualTo


class RegistrationForm(FlaskForm):
    username = StringField('Username', validators=[DataRequired(), Length(min=2, max=20)])
    email = StringField('Email',validators=[DataRequired(), Email()])
    password = PasswordField('Password', validators=[DataRequired()])
    confirm_password = PasswordField('Confirm Password', validators=[DataRequired(), EqualTo('password')])
    submit = SubmitField('Sign Up')


class LoginForm(FlaskForm):
    email = StringField('Email',validators=[DataRequired(), Email()])
    password = PasswordField('Password', validators=[DataRequired()])
    remember = BooleanField('Remember Me')
    submit = SubmitField('Login')
</pre>
</div>


<p>
Now we need to set a <code>secret key</code> for our Application
</p>
<ul class="org-ul">
<li>Secret Key is used to protect form 
<ul class="org-ul">
<li>Modifying Cookies</li>
<li>Cross-site request</li>
<li>Forgery Attacts</li>
</ul></li>

<li><p>
Generate a secret key
</p>
<div class="org-src-container">
<pre class="src src-sh">python
&gt;&gt;&gt; import secrets
&gt;&gt;&gt; secrets.token_hex(16)
'5791628bb0b13ce0c676dfde280ba245'
</pre>
</div></li>
</ul>


<p>
Import <code>class (form , login)</code> from <code>form.py</code> &gt;&gt; <code>from forms import RegistrationForm, LoginForm</code>
</p>
<ul class="org-ul">
<li>And add route <code>register, login</code> and create template <code>register.html, login.html</code></li>
<li>If registration is not valid user need to notify in register.html page
<ul class="org-ul">
<li>add <code>flask-message</code> in <code>register.html</code>  if users didn't give valid message</li>
</ul></li>
<li>After registeration is <b>successful</b> need to notify the user using <code>flash-message</code> <code>flash(f'Account created for {form.username.data}!', 'success')</code> in <code>flaskblog.py</code> after registeration and re-route to <code>home page</code></li>
<li>Add <code>flask-message</code> to html layout <code>layout.html</code>
<ul class="org-ul">
<li><code>flash-message(flash("Register is created","Successful"))</code> has to input <code>message and category</code> which is stored as  <code>messages</code>
<ul class="org-ul">
<li>this flash data is used in jinja2 template in layout.html or register.html or login.html which will be discussed below</li>
</ul></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-python"># myflask-app/flaskblog.py
from flask import Flask, render_template, url_for, flash, redirect
from forms import RegistrationForm, LoginForm

app = Flask(__name__)
app.config['SECRET_KEY'] = '5791628bb0b13ce0c676dfde280ba245'

posts = [
    {
	'author': 'Corey Schafer',
	'title': 'Blog Post 1',
	'content': 'First post content',
	'date_posted': 'April 20, 2018'
    },
    {
	'author': 'Jane Doe',
	'title': 'Blog Post 2',
	'content': 'Second post content',
	'date_posted': 'April 21, 2018'
    }
]


@app.route("/")
@app.route("/home")
def home():
    return render_template('home.html', posts=posts)


@app.route("/about")
def about():
    return render_template('about.html', title='About')


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegistrationForm()
    if form.validate_on_submit():
	flash(f'Account created for {form.username.data}!', 'success')
	return redirect(url_for('home'))
    return render_template('register.html', title='Register', form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    if form.validate_on_submit():
# This is for testing or development
	if form.email.data == 'admin@blog.com' and form.password.data == 'password':
	    flash('You have been logged in!', 'success')
	    return redirect(url_for('home'))
	else:
	    flash('Login Unsuccessful. Please check username and password', 'danger')
    return render_template('login.html', title='Login', form=form)


if __name__ == '__main__':
    app.run(debug=True)
</pre>
</div>

<ul class="org-ul">
<li><p>
Add flash-message(<code>flash() in flaskblog.py</code>) if there is a message then print <code>get_flashed_message()</code> to html template in <code>layout.html</code>
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;!-- layout.html --&gt;
&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;

    &lt;link rel="stylesheet" type="text/css" href="{{ url_for('static', filename='main.css') }}"&gt;

    {% if title %}
	&lt;title&gt;Flask Blog - {{ title }}&lt;/title&gt;
    {% else %}
	&lt;title&gt;Flask Blog&lt;/title&gt;
    {% endif %}
&lt;/head&gt;
&lt;body&gt;
    &lt;main role="main" class="container"&gt;
	&lt;div class="col-md-8"&gt;
&lt;!-- Flask message block Strat--&gt;
	  {% with messages = get_flashed_messages(with_categories=true) %}
	    {% if messages %}
	      {% for category, message in messages %}
		&lt;div class="alert alert-{{ category }}"&gt;
		  {{ message }}
		&lt;/div&gt;
	      {% endfor %}
	    {% endif %}
	  {% endwith %}
&lt;!-- Flask message block End--&gt;

&lt;!-- Content Block Strat --&gt;
	  {% block content %}
	  {% endblock %}
&lt;!-- Content Block End --&gt;
      &lt;/div&gt;
  &lt;/main&gt;


&lt;/body&gt;
&lt;/html&gt;

</pre>
</div></li>
</ul>


<ul class="org-ul">
<li>If registration is not valid user need to notify in register.html page
<ul class="org-ul">
<li>add <code>flask-message</code> in <code>register.html</code>  if users didn't give valid input in user-name, email, password print the error using <code>flash message</code></li>
</ul></li>
</ul>

<p>
Below code is without flash Error message (if No Valid Input is given) in Registration template <code>register.html</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;!-- register.html --&gt;
{% extends "layout.html" %}
{% block content %}
    &lt;div class="content-section"&gt;
	&lt;form method="POST" action=""&gt;
	    {{ form.hidden_tag() }}
	    &lt;fieldset class="form-group"&gt;
		&lt;legend class="border-bottom mb-4"&gt;Join Today&lt;/legend&gt;
		&lt;div class="form-group"&gt;
		    {{ form.username.label(class="form-control-label") }}
		    {{ form.username(class="form-control form-control-lg") }}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.email.label(class="form-control-label") }}
		    {{ form.email(class="form-control form-control-lg") }}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.password.label(class="form-control-label") }}
		    {{ form.password(class="form-control form-control-lg") }}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.confirm_password.label(class="form-control-label") }}
		    {{ form.confirm_password(class="form-control form-control-lg") }}
		    {% endif %}
	    &lt;/fieldset&gt;
	    &lt;div class="form-group"&gt;
		{{ form.submit(class="btn btn-outline-info") }}
	    &lt;/div&gt;
	&lt;/form&gt;
    &lt;/div&gt;
    &lt;div class="border-top pt-3"&gt;
	&lt;small class="text-muted"&gt;
	    Already Have An Account? &lt;a class="ml-2" href="{{ url_for('login') }}"&gt;Sign In&lt;/a&gt;
	&lt;/small&gt;
    &lt;/div&gt;
{% endblock content %}

</pre>
</div>

<p>
Below code is if error message then print the flash message     
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;!-- register.html --&gt;
{% extends "layout.html" %}
{% block content %}
    &lt;div class="content-section"&gt;
	&lt;form method="POST" action=""&gt;
	    {{ form.hidden_tag() }}
	    &lt;fieldset class="form-group"&gt;
		&lt;legend class="border-bottom mb-4"&gt;Join Today&lt;/legend&gt;
		&lt;div class="form-group"&gt;
		    {{ form.username.label(class="form-control-label") }}

		    {% if form.username.errors %}
			{{ form.username(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.username.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.username(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.email.label(class="form-control-label") }}
		    {% if form.email.errors %}
			{{ form.email(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.email.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.email(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.password.label(class="form-control-label") }}
		    {% if form.password.errors %}
			{{ form.password(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.password.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.password(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.confirm_password.label(class="form-control-label") }}
		    {% if form.confirm_password.errors %}
			{{ form.confirm_password(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.confirm_password.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.confirm_password(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
	    &lt;/fieldset&gt;
	    &lt;div class="form-group"&gt;
		{{ form.submit(class="btn btn-outline-info") }}
	    &lt;/div&gt;
	&lt;/form&gt;
    &lt;/div&gt;
    &lt;div class="border-top pt-3"&gt;
	&lt;small class="text-muted"&gt;
	    Already Have An Account? &lt;a class="ml-2" href="{{ url_for('login') }}"&gt;Sign In&lt;/a&gt;
	&lt;/small&gt;
    &lt;/div&gt;
{% endblock content %}

</pre>
</div>

<p>
Simillary like register.html we need to create login.html
</p>

<div class="org-src-container">
<pre class="src src-html">{% extends "layout.html" %}
{% block content %}
    &lt;div class="content-section"&gt;
	&lt;form method="POST" action=""&gt;
	    {{ form.hidden_tag() }}
	    &lt;fieldset class="form-group"&gt;
		&lt;legend class="border-bottom mb-4"&gt;Log In&lt;/legend&gt;
		&lt;div class="form-group"&gt;
		    {{ form.email.label(class="form-control-label") }}
		    {% if form.email.errors %}
			{{ form.email(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.email.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.email(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
		&lt;div class="form-group"&gt;
		    {{ form.password.label(class="form-control-label") }}
		    {% if form.password.errors %}
			{{ form.password(class="form-control form-control-lg is-invalid") }}
			&lt;div class="invalid-feedback"&gt;
			    {% for error in form.password.errors %}
				&lt;span&gt;{{ error }}&lt;/span&gt;
			    {% endfor %}
			&lt;/div&gt;
		    {% else %}
			{{ form.password(class="form-control form-control-lg") }}
		    {% endif %}
		&lt;/div&gt;
		&lt;div class="form-check"&gt;
		    {{ form.remember(class="form-check-input") }}
		    {{ form.remember.label(class="form-check-label") }}
		&lt;/div&gt;
	    &lt;/fieldset&gt;
	    &lt;div class="form-group"&gt;
		{{ form.submit(class="btn btn-outline-info") }}
	    &lt;/div&gt;
	    &lt;small class="text-muted ml-2"&gt;
		&lt;a href="#"&gt;Forgot Password?&lt;/a&gt;
	    &lt;/small&gt;
	&lt;/form&gt;
    &lt;/div&gt;
    &lt;div class="border-top pt-3"&gt;
	&lt;small class="text-muted"&gt;
	    Need An Account? &lt;a class="ml-2" href="{{ url_for('register') }}"&gt;Sign Up Now&lt;/a&gt;
	&lt;/small&gt;
    &lt;/div&gt;
{% endblock content %}

</pre>
</div>
</div>
</div>
