program/Note_flask.org
* Create a Database db using sqlAlchemy
sqlalchemy is intermeditae which is used to connect different types of database
- With sqlalchemy we can access db as class
  
Suppose you want to
- sqllite for dev enviroment
- mysql for testing
- psql for production

  Then by using sqlalchemy we just need to change the database without changing the code.

  Install sqlalchemy using =pip install flask-sqlalchemy=
   - to link =from flask_sqlalchemy import SQLAlchemy=
   - There is sqlalchemy but flask-sqlalchemy has some flask sql link

Let use sqllite database
** Create sqllite database
#+begin_src 

#+end_src
** Link sqllite in flask-app
Add below line in flaskblog.py to add db in flaskblog.py
- =app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///site.db'=
- =db = SQLAlchemy(app)= for db creation if NOT created.

  
