program/Note_flask.html

<div id="outline-container-org7a35755" class="outline-2">
<h2 id="org7a35755">Create a Database db using sqlAlchemy</h2>
<div class="outline-text-2" id="text-org7a35755">
<p>
sqlalchemy is intermeditae which is used to connect different types of database
</p>
<ul class="org-ul">
<li>With sqlalchemy we can access db as class</li>
</ul>

<p>
Suppose you want to
</p>
<ul class="org-ul">
<li>sqllite for dev enviroment</li>
<li>mysql for testing</li>
<li><p>
psql for production
</p>

<p>
Then by using sqlalchemy we just need to change the database without changing the code.
</p>

<p>
Install sqlalchemy using <code>pip install flask-sqlalchemy</code>
</p>
<ul class="org-ul">
<li>to link <code>from flask_sqlalchemy import SQLAlchemy</code></li>
<li>There is sqlalchemy but flask-sqlalchemy has some flask sql link</li>
</ul></li>
</ul>

<p>
Let use sqllite database
</p>
</div>
<div id="outline-container-orgf394920" class="outline-3">
<h3 id="orgf394920">Create sqllite database</h3>
<div class="outline-text-3" id="text-orgf394920">
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-org4ce9783" class="outline-3">
<h3 id="org4ce9783">Link sqllite in flask-app</h3>
<div class="outline-text-3" id="text-org4ce9783">
<p>
Add below line in flaskblog.py to add db in flaskblog.py
</p>
<ul class="org-ul">
<li><code>app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///site.db'</code></li>
<li><code>db = SQLAlchemy(app)</code> for db creation if NOT created.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DeepAlgorithms</p>
<p class="date">Created: 2023-03-16 Thu 11:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
